### **MICE Algorithm(Multivarient Impuation By Chained Equations)**

We use this algorithm when the data is missing at random.

It is accurate.\
It becomes slow as we use the machinelearning algorithm to fill the missing values.

Following picutres show the steps invloved in the iteravtive impuation.

1. At first the output from the dataset is removed.
![image](1.png)

2.Then the False nan values are introduced in the dataset.
![image](2.png)

3. Then  predicting algotihm are applied to the input dataset such that: at each step one column of the dataset is marked for the output and the other are used to prdict the value at that point.
![image](3.png) 
![image](4.png) 
![image](5.png) 
![image](6.png)

4. Then the multiple iteration of such are done untill the difference in the perdicted value in the two iteration reaches near zero which is the predicated fitted value.
![image](7.png)

In [25]:
import pandas as pd
import numpy as np
from sklearn.linear_model import LinearRegression

In [26]:
url='https://raw.githubusercontent.com/campusx-official/100-days-of-machine-learning/main/day40-iterative-imputer/50_Startups.csv'
data=pd.read_csv(url)
data.head()

   R&D Spend  Administration  Marketing Spend       State     Profit
0  165349.20       136897.80        471784.10    New York  192261.83
1  162597.70       151377.59        443898.53  California  191792.06
2  153441.51       101145.55        407934.54     Florida  191050.39
3  144372.41       118671.85        383199.62    New York  182901.99
4  142107.34        91391.77        366168.42     Florida  166187.94

In [27]:
data.isnull().sum()

R&D Spend          0
Administration     0
Marketing Spend    0
State              0
Profit             0
dtype: int64

In [28]:
data=np.round(data[['R&D Spend','Administration','Marketing Spend','Profit']]/1000)
np.random.seed(9)
data=data.sample(5)#pciking out only 5 of the data to illustrate the steps involved
data

    R&D Spend  Administration  Marketing Spend  Profit
21       78.0           154.0            300.0   111.0
37       44.0            51.0            197.0    90.0
2       153.0           101.0            408.0   191.0
14      120.0           157.0            257.0   133.0
44       22.0           155.0             28.0    65.0

In [29]:
data=data.iloc[:,0:-1]
data

    R&D Spend  Administration  Marketing Spend
21       78.0           154.0            300.0
37       44.0            51.0            197.0
2       153.0           101.0            408.0
14      120.0           157.0            257.0
44       22.0           155.0             28.0

In [32]:
#introducing null values in the columns
data.iloc[1,0]=np.nan
data.iloc[3,1]=np.nan
data.iloc[-1,-1]=np.nan

C:\Users\Acer\AppData\Local\Temp\ipykernel_25080\2670690348.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  data.iloc[1,0]=np.nan
C:\Users\Acer\AppData\Local\Temp\ipykernel_25080\2670690348.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  data.iloc[3,1]=np.nan
C:\Users\Acer\AppData\Local\Temp\ipykernel_25080\2670690348.py:4: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  data.iloc[-1,-1]=np.nan

In [31]:
data

    R&D Spend  Administration  Marketing Spend
21       78.0           154.0            300.0
37        NaN            51.0            197.0
2       153.0           101.0            408.0
14      120.0             NaN            257.0
44       22.0           155.0              NaN

In [34]:
#creating another dataframe to hold the values
df0=pd.DataFrame()
df0['R&D Spend']=data['R&D Spend'].fillna(data['R&D Spend'].mean())
df0['Administration']=data['Administration'].fillna(data['Administration'].mean())
df0['Marketing Spend']=data['Marketing Spend'].fillna(data['Marketing Spend'].mean())